client/result/warp/result-warp-200-1.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.5.160 (be patient)
Send request failed!
Send request failed!
Send request failed!
[...]


Server Software:        Warp/1.2.0.1
Server Hostname:        192.168.5.160
Server Port:            8123

Document Path:          /index
Document Length:        99 bytes

Concurrency Level:      128
Time taken for tests:   0.071 seconds
Complete requests:      200
Failed requests:        26
   (Connect: 0, Receive: 14, Length: 12, Exceptions: 0)
Write errors:           25
Total transferred:      81872 bytes
HTML transferred:       19206 bytes
Requests per second:    2820.28 [#/sec] (mean)
Time per request:       45.386 [ms] (mean)
Time per request:       0.355 [ms] (mean, across all concurrent requests)
Transfer rate:          1127.45 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        4   23  15.2     23      41
Processing:     0    9  12.3      4      39
Waiting:        0    8  12.1      3      39
Total:          8   32  11.0     38      45

Percentage of the requests served within a certain time (ms)
  50%     38
  66%     39
  75%     40
  80%     40
  90%     41
  95%     43
  98%     44
  99%     44
 100%     45 (longest request)