client/result/warp/result-warp-30000-3.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.5.160 (be patient)
Send request failed!
Send request failed!
Send request failed!
[...]


Server Software:        Warp/1.2.0.1
Server Hostname:        192.168.5.160
Server Port:            8123

Document Path:          /index
Document Length:        0 bytes

Concurrency Level:      128
Time taken for tests:   33.098 seconds
Complete requests:      30000
Failed requests:        29686
   (Connect: 0, Receive: 25, Length: 29661, Exceptions: 0)
Write errors:           1815
Total transferred:      12520920 bytes
HTML transferred:       2936835 bytes
Requests per second:    906.41 [#/sec] (mean)
Time per request:       141.216 [ms] (mean)
Time per request:       1.103 [ms] (mean, across all concurrent requests)
Transfer rate:          369.44 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        4  140  17.7    144     307
Processing:     0    1   1.8      0      47
Waiting:        0    0   1.8      0      59
Total:          7  141  17.1    144     307

Percentage of the requests served within a certain time (ms)
  50%    144
  66%    147
  75%    149
  80%    150
  90%    153
  95%    157
  98%    164
  99%    168
 100%    307 (longest request)