client/result/warp/result-warp-500-1.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.5.160 (be patient)
Send request failed!
Send request failed!
Send request failed!
[...]


Server Software:        Warp/1.2.0.1
Server Hostname:        192.168.5.160
Server Port:            8123

Document Path:          /index
Document Length:        99 bytes

Concurrency Level:      128
Time taken for tests:   0.160 seconds
Complete requests:      500
Failed requests:        28
   (Connect: 0, Receive: 18, Length: 10, Exceptions: 0)
Write errors:           20
Total transferred:      209164 bytes
HTML transferred:       49104 bytes
Requests per second:    3134.68 [#/sec] (mean)
Time per request:       40.834 [ms] (mean)
Time per request:       0.319 [ms] (mean, across all concurrent requests)
Transfer rate:          1280.59 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        3   32  13.6     37      53
Processing:     0    4   8.0      1      38
Waiting:        0    3   7.9      0      38
Total:          5   36   9.7     38      53

Percentage of the requests served within a certain time (ms)
  50%     38
  66%     40
  75%     40
  80%     41
  90%     45
  95%     50
  98%     52
  99%     53
 100%     53 (longest request)