client/result/warp/result-warp-500-3.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.5.160 (be patient)
Send request failed!
Send request failed!
Send request failed!
[...]


Server Software:        Warp/1.2.0.1
Server Hostname:        192.168.5.160
Server Port:            8123

Document Path:          /index
Document Length:        0 bytes

Concurrency Level:      128
Time taken for tests:   0.229 seconds
Complete requests:      500
Failed requests:        482
   (Connect: 0, Receive: 64, Length: 418, Exceptions: 0)
Write errors:           325
Total transferred:      170596 bytes
HTML transferred:       39996 bytes
Requests per second:    2184.15 [#/sec] (mean)
Time per request:       58.604 [ms] (mean)
Time per request:       0.458 [ms] (mean, across all concurrent requests)
Transfer rate:          727.75 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       26   49  12.1     46      81
Processing:     0    5  11.2      0      42
Waiting:        0    5  10.2      2      40
Total:         27   54  19.6     46     103

Percentage of the requests served within a certain time (ms)
  50%     46
  66%     47
  75%     64
  80%     81
  90%     87
  95%     95
  98%    100
  99%    100
 100%    103 (longest request)